[
    {   
    "title": "General Manager",
    "location": "Milwaukee, WI",
    "description": "Manage the day-to-day operations of the company to ensure smooth operations. Manage all human resources activities such as recruitment, hiring and firing, determining wages, administering disciplinary procedures and other personnel matters. Oversee training of all staff. Review financial statements and sales reports to ensure goals are being achieved. Estimate anticipated expenditures and analyze records of present and past operations, trends, and costs, estimated and realized revenues, administrative commitments and obligations incurred. Oversee the preparation of budgets and financial forecasts and present financial reports to the President for review. Communicate with customers to increase sales and manage the company’s brand. Manage sales reps and ensure they are meeting sales goals. Ensure compliance with all applicable regulations. Oversee and direct all marketing and company branding activities. Telecommuting is available. Employer: E. L. Simeth Co., Inc. ELSCI/GM/CA 12/7/23"
    },
    {
    "title": "Assistant Accountant",
    "location": "El Monte, CA",
    "description": "Bachelor's degree in Accounting, Finance, Economics or related (foreign equivalent not acceptable). Maintain and analyze financial information, review accounts receivable, etc. Employer: JZL Inc., 4308 Baldwin Avenue, El Monte, CA 91731. Salary: $54,704 per year. Resume to: L. Sun, Accountant (AA20904), JZL Inc., 4308 Baldwin Avenue, El Monte, CA 91731. JZLI/AA/CA 11/30/23"
    },
    {
    "title": "Design Engineer",
    "location": "Woodland Hills, CA",
    "description": "Read and understand architectural and topography plans. Calculate seismic load based on seismic current code (ASCE 7-16). Calculate building gravity loads and design structural beams, and columns. Design required foundation based on calculated loads and soil report recommendation. Provide required structural detailing. Determine method of LID calculation that fits the project. Provide LID plans and Reports based on assumed method. Calculate volume of the cut and fill for the property. Calculate new elevations based on property needs. Provided grading & drainage plans. 40 hrs/wk, F/T. Req. Masters in Civil Engineering, Construction Management or equivalent. In alternative, Bachelor's in Civil Engineering, Civil Technology Engineering, Construction Management or equivalent plus five years experience as Construction Manager, Structural Engineer, Project Control Supervisor, Technical Supervisor or suitable combo of educ, training and/or exp is acceptable. Mail resume to Safe Structural Engineering, Inc., 23123 Ventura Boulevard, Suite 211, Woodland Hills, CA 91364. Attn: H. Samadzadeh, GM. SSEI/DE/CA 11/17/23"
    },
    {
    "title": "Sr. AI Research Engineer",
    "location": "Poway, CA",
    "description": "Analyze problems, research and develop state-of-the-art machine learning techniques for various applications such as robotics, resource scheduling, drone swarm systems, manned-unmanned teaming, cybersecurity and software defined networking. Apply theoretical expertise and innovation in deep learning/reinforcement learning (DL/RL). Collaborate with software engineers to design and run experiments, including designing and evaluating new algorithms as well as implementing known algorithms. Develop custom DL/RL models and algorithms. Optimize and deploy novel AI solutions on embedded systems. Document design specification, experimentation methodology, and performance results for reports and publication materials such as research papers. Regularly meet with managers to communicate and present results and research findings to senior management. Telecommuting is available. Employer: EpiSys Science, Inc. dba EpiSci. ESI/SAIRE/CA 10/15/23"
    },
    {
    "title": "Cost Estimator",
    "location": "Oxnard, CA",
    "description": "Cost Estimator needed full-time by electrical contractor to analyze diagrams to prepare cost estimate for projects; prepare bid; give input to reduce design errors, etc. BS Electrical Engineering required. Mail resume to job/interview site: Hayek Electric, 2345 Eagle Creek Lane, Oxnard, CA 93036. HE/CE/CA 11/13/23"
    },
    {
    "title": "Director of Finance",
    "location": "Las Vegas, NV",
    "description": "Manage all financial operations of the company including all employees in the finance department. Ensure all company finances are properly managed, accounted for and in compliance with all applicable financial regulations. Direct key finance and reporting operations such as budgeting, planning, forecasting, financial and regulatory reporting, internal controls, risk management, procure-to-pay cycle, and compliance with contractual documents and government regulations. Ensure that company policies, procedures, and internal controls are followed as they relate to finance and accounting operations. Apply GAAP principles and direct finance team to ensure that annual revenue, expense, and capital budgeting processes are executed seamlessly. Prepare annual and other budgets and project future budgets and capital needs. Direct team to provide financial data and reports to use in conducting revenue and expense trend analysis. Hire additional finance department staff as needed. Telecommuting is available. Employer: Sega Sammy Creation USA, Inc. SSCUSAI/DOF/CA 11/8/23"
    },
    {
    "title": "Solar Energy Systems Engineer",
    "location": "Napa, CA",
    "description": "Responsible for overseeing evaluation and regulation of energy efficiency within plans for solar energy systems, design, development, installation, and monitoring of solar photovoltaic systems within the legal framework of EPC (Engineering Precurement and Construction) environment for diesel hybrid systems, grid-tied energy solar PV systems, off-grid and standalone solar PV systems. Perform solar PV system monitoring including system performance, optimization, and feed-in tariff management. Perform site audits to gather and review data of systems. Oversee, review, and interpret electrical single-line diagrams and connection diagrams for solar systems. Oversee the legal regulatory management of load shedding contingency planning and management as well as load shifting and peak shaving through demand management and automatic surplus generation activation. Conduct energy audits for energy optimization and implementation of remedy measures. Salary: $74,300. Telecommuting is available. Employer: Bright Power, Inc. BPI/SESE/CA 10/31/23"
    },
    {
    "title": "Applications Developer",
    "location": "Austin, TX",
    "description": "Applications Developer needed at AlpineReplay, Inc. dba Trace for its Austin, TX office. Full time, must have Bachelor’s degree in Mathematics, Computer Science, or Computer Engineering. Duties: Analyze target users’ needs, and design, test and develop new and existing applications for the Android and IOS platforms from conceptualization to launch. Work with the Web development team and mobile engineers to specify algorithm requirements, and implement and test those APIs in collaboration with web and backend teams. Build algorithm and develop tools in performing tests and analysis for algorithm evaluations. Oversee mathematical statistics, tracking, and GPS systems. Develop Android and IOS multithreaded applications by developing, combining, and integrating the following modules, elements, and technologies: Native Android and iOS Code Modules; C++ and C Modules and libraries that work inside Android and IOS applications, SDK and other languages common for Android and iOS; internal databases that can be used with Android and iOS applications; integration of Bluetooth and Wi-Fi communication on multiple platforms; efficient use and integration of GPS and inertial sensor measurements; integration of maps from multitude of sources, voice, and video by using internal (mobile phone) and external sources; and efficient and reliable communication with the backend server. Estimate appropriate configuration parameters for the software application. Create a variety of models and diagrams (such as flowcharts) that instruct programmers how to write the software code. Design each piece of the program and plan how the pieces will work together. Conduct unit test of software applications using web-based or mobile-based platforms, and resolve problems encountered during various testing cycles. Document and present proposed methods and solutions using visual aids. Recommend updates for existing applications. Ensure that the software continues to function normally through software maintenance and testing. Document every aspect of the application or system as reference for future maintenance and upgrades. Collaborate with other computer specialists to create optimum software. Specify power supply requirements and configuration. Send resume/application to Chief Technology Officer (CTO) AlpineReplay, Inc. dba Trace, 16561 Bolsa Chica St. Suite 106, Huntington Beach, CA 92649. ARI/AD/CA 10/20/23"
    },
    {
    "title": "Technical Sales Specialist",
    "location": "Downey, CA",
    "description": "Technical Sales Specialist needed at Nationwide Lighting & Electric Supply, Inc. Full-time position requires Bachelor of Science degree in Electrical Engineering or in Electronics & Communications Engineering and 1-year experience in technical sales. Duties: Analyze and establish the customers’ need by reviewing and interpreting technical specifications before recommending appropriate lighting and electric supply products offered by the company. Provide direct technical support to customers by assisting them in selecting lighting and electrical supply products based on their needs and product specifications, and applicable regulations. Explain product features to customers including the products’ capabilities and limitations. Answer inquiries and questions from customers related to ongoing use of lighting and electric supply products, maintenance requirements, operations, and other related information. Drive continued sales by checking customer purchasing history, suggesting new and related products, and explaining technical features. Obtain building blueprints or specifications for use by engineering department in bid preparations. Develop new accounts by researching and identifying potential leads, and soliciting new business by contacting existing and prospective customers, to discuss how specific products can meet their needs by providing technical information and advice. Provide customers with product information, price, availability, and credit/payment terms. Finalize orders and transfer them to fulfillment to be filled. Communicate and coordinate with customers about delivery schedules, service contracts, warranties, and other information related to purchased products. Inform customers about issues related to responsible use and disposal of lighting and electric supply products, such as waste reduction or product or byproduct recycling or disposal. Maintain accurate, organized paper and digital customer records. Send resume/application to President, Nationwide Lighting & Electric Supply, Inc., 12310 Woodruff Avenue, Downey, CA 90241. NLESI/TSS/CA 10/18/23"
    },
    {
    "title": "Equity Analyst",
    "location": "Newport Beach, CA",
    "description": "Bachelor;s degree (or foreign equivalent) in Finance or Economics, 1 year of experience as a Financial Analyst, Equity Analyst, Equity Research Analyst, or related, and Chartered Financial Analyst (CFA) designation required. Engage in comprehensive analysis of business models and accounting statements, cash flow analysis, event-driven analysis, etc. for wealth management services company. Employer: The Bahnsen Group, 520 Newport Center Dr., Ste. 300, Newport Beach, CA 92660. Salary: $110,000 to $123,240/yr. Resume to: R. Austin (EA2051), The Bahnsen Group, 520 Newport Center Dr., Ste. 300, Newport Beach, CA 92660. TBG/EA/CA 10/18/23"
    },
    {
    "title": "IT Project Manager",
    "location": "New York, NY",
    "description": "Manage and lead engineers and other technical staff working for the company, clients, and third-party vendors to complete IT upgrades, customizations, maintenance systems and other technical projects for banks and other customers. Ensure the project is completed on schedule, within budget. Review all project deliverables to ensure adherence to quality standards. Prepare and submit regular project reports to customers. Confer with all stakeholders and project personnel to identify problems and implement solutions. Assess client business operations and requirements to prioritize project milestones, overall project scope and systems needed. Manage IT system testing and implementation. Telecommuting is available. Employer– CAC America Corporation. CACAC/ITPM/CA 10/11/23"
    },
    {
    "title": "Administrative Supervisor",
    "location": "Canoga Park, CA",
    "description": "Needed full time by lighting fixtures company to do the following: welcome and assist walk-in clients; manage, create, and edit company social media posts, videos, and ads using computer system; enforce company policies; track orders, manage inventory; maintain showroom upkeep such as ordering supplies, shipping, and handling; prepare and update store tagging (prices, special promotions, etc.); work with suppliers and process orders to update samples, etc. Must have bachelor's degree (any major). Mail resume to job/interview site: American Best Buy Agency, Inc., 7751 Alabama Ave., Ste. 1, Canoga Park, CA 91304. ABBAI/AS/CA 10/9/23"
    },
    {
    "title": "Computer Analyst",
    "location": "Indio, CA",
    "description": "Computer Analyst for pediatric office. Bachelor’s degree (or foreign equivalent) in Computer Science or related field required. Maintain and administer computer network, system software, applications, and configurations for company computers. Employer: M. Nieves Gutierrez-Go, M.D., Inc., 80-495 US Highway 111, Indio CA 92201. Wage: $60,986 to $75,587 per year. Resume to: Patricia Moreno, Asst. Office Manager (CA1244), M. Nieves Gutierrez-Go, M.D., Inc., 80-495 US Highway 111, Indio CA 92201. MNGMDI/CA/CA 9/7/23"
    },
    {
    "title": "Dentist",
    "location": "Manhattan Beach, CA",
    "description": "Exam patient teeth, gums, jaws, and related tissues, using dental instruments, x-rays, or other diagnostic equipment, to evaluate dental health, diagnose diseases or abnormalities, and plan appropriate treatments. Remove decay from teeth and fill cavities. Repair or remove damaged teeth. Perform tooth extractions and root canals. Administer anesthetics to keep patients from feeling pain during procedures. Make models and measurements for dental appliances, such as dentures. Use dental air turbines, hand instruments, dental appliances, or surgical implements. Formulate plan of treatment for patient's teeth and mouth tissue. Fabrication, and fitting of snoring, bruxism, and sleep apnea dental devices. Employer – Mohindra & Razi Dental Partnership dba Modern American Dentistry. MAD/D/CA 8/30/23"
    },
    {
    "title": "Quality Assurance Manager",
    "location": "Sun Valley, CA",
    "description": "Monitor performance of quality control systems and train QA specialists in MRB and quality assurance. Train inspectors in different inspections methods, techniques, and use of calibrating inspection tools. Review and update SOPs, training manuals and policies for reference. Manage internal and external quality issues and facilitate audits. Analyze quality control systems and make changes where necessary to reduce defects. Manage MRB process including NCRs, RMAs and corrective actions. Establish quality department improvement goals. Analyze quality control test results and communicate them to team members to improve production. Ensure company is current on industry standards and certifications. Employer – Precision Aircraft Machining Company, Inc., dba PAMCO. PAMCO/QAM/CA 8/28/23"
    },
    {
    "title": "Sr. Accountant",
    "location": "Los Angeles, CA",
    "description": "Responsible for the preparation and examination of financial records. Verify that financial records are accurate, and taxes are paid properly and on time. Prepare entries to accounts, such as general ledger accounts, documenting business transactions as well as preparing financial reports. Analyze financial information detailing assets, liabilities, and capital. Prepare and analyze balance sheets, income statements, statements of cash flow, and other reports to summarize the current and projected financial position utilizing General Accepted Accounting Principles. Examine financial statements to ensure that they are accurate and comply with laws and regulations. Prepare written reports based upon review of financial documents to check for irregularities and in reporting classifications of financial transactions. Prepare budget and financial forecasts and develop periodic reports. Telecommuting is available. Travel domestically to Los Angeles 1 week every month. Employer – Avanti Capital Investments, LLC. ACILLC/SA/CA 8/23/23"
    },
    {
    "title": "Civil Engineer",
    "location": "Glendale, CA",
    "description": "Will perform engineering duties in planning, designing, and overseeing construction and maintenance of building structures and facilities, such as drawing, designing and installation of railings, gates, fences, structural steel elevator support, structural beams and columns including structural steel stairs, perform job progress and completion, perform quality control of all installed work on the job site, presence at the job site daily to monitor the installation of building structures and facilities specified above, maintain communication with the employer as to existing issues and potential manufacturing defects. Forty (40) hours per week, full time. Must have Bachelor's in civil engineering, structural engineering or equivalent plus 5 years experience as civil engineer, structural engineer, equivalent or suitable combination of education, training or experience is acceptable. Mail resume to Challenger Ornamental Iron Work Inc., 437 W. Palmer Ave., Glendale, CA 91204. Attn. M. Espanosian. COIWI/CE/CA 8/16/23"
    },
    {
    "title": "Software Engineer",
    "location": "Culver City, CA",
    "description": "Full-time, needed at Eccentex Corporation, must have Master of Science in Computer Science or Computer Engineering or equivalent. Duties: Responsible for the overall performance of the AppBase platform in meeting nonfunctional system requirements around response time/throughput, systems availability, replication, caching, and scalability, among others. Evaluate and analyze the client's business requirements to determine the feasibility of design within time and cost constraints and within an application area, and the desirability of incorporating them into the design of the web-based CMS (Case Management System) application using the AppBase platform. Develop distributed, multitiered solutions on the .NET platform, including the design, development, and maintenance of several components of the AppBase platform architecture, i.e., Content Viewer, Content Management Service, Document Distribution Service, Desktop Viewer, Message Bus Service, Content Transformation Service, Capture Service, Storage Service. Design end-to-end CMS system applications by developing web parts, creating custom lists, developing workflows and custom dashboards, developing links, merging and aggregating custom views for various data sources, and establishing metadata fields with document sets, and internal and external content types. Navigate technical challenges including the development of a highly efficient dynamic content delivery AppBase platform integrated with social media and personalization services. Ensure all CMS components fit with the strategic direction of the customer and with hardware/network, and system infrastructure to include and support a highly scalable elastic cloud computing technology. Create web software development standards and modular architectures for code reuse and engineering best practices, and provide detailed architectural diagrams and standard documents. Modify existing software to correct errors, allow it to adapt to new hardware or to improve its performance, resolve design and client testing issues, and be responsible for detecting deficiencies, recommending improvements, and assessing change impacts within the current solution area. Work with the clients' project manager to review business drivers, needs and strategies, and understand implications of architectural decision, issues, and plans to the application structure. Prepare functional specifications that can be easily understood by customers and internal development teams, and create User Guide, Administration Guide, and Installation and Configuration Guides. Conduct and manage the deployment and configuration of the application to HPD production environment and ensure the completeness and accuracy of data and image migration into the new production environment/platform/system. Provide onsite training for trainers and one-on-one Administrator training solutions for each of the HPD Solution Administrators, including technical support, troubleshooting, and repair. Send resume/application by postal mail to CFO, Eccentex Corp., 6101 W. Centinela Ave.# 110, Culver City, CA 90230. EC/SE/CA 8/11/23"
    },
    {
    "title": "Training and Development Coordinator",
    "location": "Apple Valley, CA",
    "description": "Facilitate new hire orientation. Act as a resource for new hires, answering questions and providing performance feedback. Provide orientation and onboarding events and activities for new and existing employees. Lead technical and cultural training. Serve as liaison between new hires and management to resolve issues like knowledge and skills gaps, conflicts, etc. Develop assessment tools to determine an employee’s skill level. Evaluate employees' skills and knowledge to determine their overall skill level. Encourage employees to expand their knowledge and skills; direct to appropriate resources as needed. Forty (40) hours/week, full time. Must have Bachelor’s degree in Human Resources, Psychology, Organization Development or equivalent plus one year experience as Training and Development Coordinator, Administrative Assistant, HR Associate or related. Mail resume to Vista Care Center, 25155 Via Vista Road, Apple Valley, CA 92307. Attn: Anita Laygo, CEO. VCC/TDC/CA 8/1/23"
    },
    {
    "title": "Market Analyst",
    "location": "South El Monte, CA",
    "description": "Perform market research using quantitative skills and marketing principles. Bachelor’s degree (or foreign equivalent) in Marketing, Business Administration, or a related field and valid driver’s license required. Position requires local travel within a 30-mile radius to conduct research at various food markets approximately three times per week. Employer: Yihai (US) Food Inc., 2512 Central Ave., South El Monte, CA 91733. Salary: $44,803 to $60,715 per year. Mail resume to Yihai (US) Food Inc., R. Xiang (MA1161), 2512 Central Ave., South El Monte, CA 91733. YFI/MA/CA 6/29/23"
    },
    {
    "title": "General Manager",
    "location": "Miami Lakes, FL",
    "description": "Manage the day-to-day operations of the company to ensure smooth operations. Manage all human resources activities such as recruitment, hiring and firing, determining wages, administering disciplinary procedures and other personnel matters. Oversee training of all staff by subordinates. Review financial statements and sales reports to ensure goals are being achieved. Estimate anticipated expenditures and analyze records of present and past operations, trends and costs, estimated and realized revenues, administrative commitments and obligations incurred. Oversee the preparation of budgets and financial forecasts and present financial reports to company executives for review. Communicate with customers to increase sales and manage the company’s brand. Ensure compliance with all applicable regulations. Oversee and direct all marketing and company branding activities. Telecommuting is available. Employer – Mason Distributors, Inc.. MDI/GM/CA 6/22/23"
    },
    {
    "title": "Franchise Marketing Coordinator",
    "location": "Las Vegas, NV",
    "description": "Franchise Marketing Coordinator needed full-time by business coaching company to perform following: execute company's marketing strategy to assist franchisees build their customer database and following; propose plan for franchisees on managing social media postings including Facebook, Instagram, LinkedIn, YouTube, Tiktok and additional channels; assess franchisee's products and programs and make recommendations for profit potential; develop and design proposals, ads, web pages and related materials; create plans for marketing initiatives, including budget allocation, timelines, and other related issues, etc. Must have Bachelor's in Business. Mail resume to: ActionCOACH North America, LLC, 5781 S. Fort Apache Road, Las Vegas, NV 89148. ANALLC/FMC/CA 6/15/23"
    },
    {
    "title": "Photonic Design Engineer",
    "location": "Goleta, CA",
    "description": "Ideate, create, validate, and advance the design of novel photonic components and circuits that are necessary for the company’s commercial roadmap. The design of photonic components, devices, and circuit level architectures. Validate designs through the use of optical and photonic simulations, such as finite difference time domain, finite element, and beam propagation methods. Generate code-based mask layouts of verified designs. Design experimental testing methodology for the validation of designed photonic elements. Analyze experimental measurement results and their significance in dictating design flow. Develop custom, in-house back-end functionality to aid and improve the design, mask layout, and analysis steps. Translate designs into technical documents to enable the filing of patents so as to secure core IP. Work closely with other engineers responsible for design, layout, fabrication, test, and reliability. Telecommuting is available. Employer – Quintessent, Inc. QI/PDE/CA 6/15/23"
    },
    {
    "title": "Logistics Analyst",
    "location": "Pasadena, CA",
    "description": "Plan, organize and execute logistics support activities to develop an understanding of our customers’ needs and take action to ensure that such needs are met. They will participate in the assessment and review of related shipping and business change proposal impacts from international clients. Analyze and propose ways to improve trade efficiency, develop the export schedule and profits relating to international trade. Bachelors degree and two (2) years experience required. Send resume only to: Liberty Investment Exchange, Inc., 154 W. Bellevue Dr., Pasadena, CA 91105. LIEI/LA/CA 6/14/23"
    },
    {
    "title": "Data Analyst",
    "location": "Tampa, FL",
    "description": "Develop, implement, and maintain data from primary sources. Perform analysis to assess quality and meaning of data for transportation technology management. Identify trends and opportunities for growth through analysis of complex data sets. Work to identify problems and corrections to improve business performance. Bachelors degree in statistics or civil engineering technology or related. Send resume only to: Naha M. Inc., 13919 Carrolwood Village Run, Suite 16, Tampa, FL 33618. NMI/DA/CA 6/14/23"
    },
    {
    "title": "General Manager",
    "location": "Irving, TX",
    "description": "Manage the day-to-day operations of the company to ensure smooth operations. Manage all human resources activities such as recruitment, hiring and firing, determining wages, administering disciplinary procedures and other personnel matters. Oversee training of all staff by subordinates. Review financial statements and sales reports to ensure goals are being achieved. Estimate anticipated expenditures and analyze records of present and past operations, trends and costs, estimated and realized revenues, administrative commitments and obligations incurred. Oversee the preparation of budgets and financial forecasts and present financial reports to the President for review. Communicate with customers to increase sales and manage the company’s brand. Ensure compliance with all applicable regulations. Telecommuting is available. Domestic Travel to Las Vegas, Anaheim, and Honolulu 5% of the time. Employer – Ito-En North America, Inc. INAI/GM/CA 6/13/23"
    },
    {
    "title": "Financial Analyst",
    "location": "Alhambra, CA",
    "description": "Analyze company's financial information and assist with accounting reporting. MBA, MA/MS Finance, Accounting or related plus one (1) year experience. Salary: $38.36 - $46.70 per hour. Send resume to/job location: Peter Tao, Intertrans Express, Inc., 2209 W. Valley Boulevard, Alhambra, CA 91803. IEI/FA/CA 6/2/23"
    },
    {
    "title": "Bookkeeping/Accounting",
    "location": "Santa Monica, CA",
    "description": "Operate computers programmed with accounting software to record, store, and analyze information. Receive, record, and bank cash, checks, and vouchers. Check figures, postings, and documents for correct entry, mathematical accuracy, and proper codes. Perform financial calculations, such as amounts due, interest charges, balances, discounts, equity, and principal. Debit, credit, and total accounts on computer spreadsheets and databases, using specialized accounting software. Bachelors Degree in Accounting, Business or related with one (1) year experience in Accounting, Business or related. Mayer M&J Inc., 1426 Wilshire Blvd., Santa Monica, CA 90403. MMJI/BA/CA 5/25/23"
    },
    {
    "title": "Marketing Manager",
    "location": "Van Nuys, CA",
    "description": "Confer with customers by telephone or in person to provide information about products or services, take or enter orders, cancel accounts, or obtain details of complaints. Post and update content on the company's website and social media outlets. Resolve customer complaints regarding sales and service. Formulate, direct, or coordinate marketing activities or policies to promote products or services, working with advertising or promotion managers. Compile lists describing product or service offerings. Coordinate or participate in promotional activities or trade shows, working with developers, advertisers, or production managers, to market products or services. Identify, develop, or evaluate marketing strategy, based on knowledge of establishment objectives, market characteristics, and cost and markup factors. Evaluate the financial aspects of product development, such as budgets, expenditures, research and development appropriations, or return-on-investment and profit-loss projections. Bachelors Degree in Communication, Marketing, Business or related with one (1) year experience in Communication, Marketing, Business or related. Italuce Corporation, 7857 Burnet Ave., Van Nuys, CA 91405. IC/MM/ CA 5/25/23"
    },
    {
    "title": "Bookkeeping/Accounting",
    "location": "Culver City, CA",
    "description": "Operate computers programmed with accounting software to record, store, and analyze information. Receive, record, and bank cash, checks, and vouchers. Check figures, postings, and documents for correct entry, mathematical accuracy, and proper codes. Perform financial calculations, such as amounts due, interest charges, balances, discounts, equity, and principal. Debit, credit, and total accounts on computer spreadsheets and databases, using specialized accounting software. Bachelors Degree in Accounting, Business or related with one (1) year experience in Accounting, Business or related. Avalon Transportation LLC, 1000 Corporate Pointe #150, Culver City, CA 90230. ATLLC/BA/CA 5/25/23"
    },
    {
    "title": "Accountant",
    "location": "Santa Clarita, CA",
    "description": "Prepare monthly, quarterly and annual financial statements, including variance analysis on financial and operational results; responsible for budget development, monitoring analysis; prepare and manage budget operations; research, write and implement financial policies and procedures; oversee and assist in the preparation of special financial reports and analysis; organize and file annual tax returns; maintain a system of internal controls to ensure effective and efficient operations, reliable financial information and applicable laws, regulations and procedures are followed. Forty (40) hours/week Full-time. Must have Bachelor's Degree in Accountancy or equivalent plus three years experience as Accounting Supervisor, Staff Accountant or suitable combination of education, training or experience is acceptable. Please mail resume to Pinnacle Peak Dental Center, 24148 Lyons Avenue, Santa Clarita, CA 91321. Attn: Lawrence M. Lozada, President. PPDC/A/CA 5/19/23"
    },
    {
    "title": "Account Coordinator/Public Relations",
    "location": "Los Angeles, CA",
    "description": "Lobeline Communications LLC. is seeking a full-time Account Coordinator/Public Relations in Los Angeles, CA. Job Duties: Create, develop, and implement publicity campaigns. Conduct proactive and reactive media pitching. Pitch stories and manage various media. Create media and influencer lists to execute PR campaigns. Schedule clients' news releases on PRNewswire. Identify, pitch, and secure speaking opportunities via panels, summits, keynotes, etc. Identify, curate, and evaluate potential partnership opportunities to align with client strategic needs. Provide client service administration. Prepare client status and activity reports, call agendas and recaps. Compile media monitoring reports and competitor coverage, scheduling and logistics. Analyze coverage across online, offline, and blogs, and leverage added value from all PR activity. Research industry trends and competitor innovations. Coordinate brand collaborations and press and influencer events. The minimum education requirement is a Bachelor’s Degree in Communication, Public Relations or related field. Special skills required: Proficiency in Cision, Muckrack, Propel PR, Qualtrics, SPSS, Associated Press Style, WordPress, Shopify, Adobe CC Photoshop, InDesign, Illustrator, and Social Media Management. Send resumes and copy of job ad to HR Department, Lobeline Communications LLC. 6464 Sunset Blvd, Suite 670, Los Angeles, CA 90028. LCLLC/ACPR/CA 5/17/23"
    },
    {
    "title": "Sales Manager",
    "location": "San Diego, CA",
    "description": "Manage all sales activities and employees involved in sales and business development. Identify and review business opportunities and develop sales strategies and plans with potential customers for company products. Manage development of sales strategies considering input and production cost, market and industry trends factors and other variables. Formulate sales activities and product pricing with senior management and for collaboration with potential business partners. Review sales reports and activities to prepare reports for review by senior management. Resolve customer service issues through sales team. 5/17/23"
    },
    {
    "title": "Director of Technology",
    "location": "Santa Fe Springs, CA",
    "description": "Manage all company IT projects to ensure all projects, upgrades, customizations, maintenance systems and other technical projects are completed within budget and time frame. Review and monitor all project deliverables to ensure adherence to quality standards. Regularly confer with outside vendors, contractors and project personnel for project status and issues resolution. Manage all IT system testing and implementation. Define company standards for systems, equipment, and software. Telecommuting is available. Employer – Venus Et Fleur LLC. VEFLLC/DOT/CA 5/17/23"
    },
    {
    "title": "Graphic Designer",
    "location": "Los Angeles, CA",
    "description": "The Korea Times Los Angeles, Inc. in Los Angeles, CA seeks Graphic Designer. Create graphic designs, concepts and layouts. Produce graphics, ads, logos, direct mailers, etc. Use computer software to generate images. Research on design trends and design ideas. Salary: $41,579 a year. Send resume to HR at 3731 Wilshire Blvd., 10th Floor, Los Angeles, CA 90010. TKTLAI/GD/CA 5/17/23"
    },
    {
    "title": "Landscape Designer",
    "location": "Pacific Palisades, CA",
    "description": "Collect photo journals of site information, prepare site layouts per client request and design observations, create AutoCAD designs; work with client, contractors, and install team to ensure design intent and size, quantity, and quality of plant materials. Other related duties as may be required or assigned. The minimum education requirement is a Bachelor’s Degree in Interior Architecture and Environmental Design or related field. Must have at least 24 months of experience in Landscape Design. Special skills required: Proficiency in AutoCAD, Adobe Photoshop, InDesign, Illustrator, XD, Revit, Sketch Up, and Vector Works; Knowledge in Procore Project Management and Oracle Project Management. Send resumes and copy of job ad to HR Department, LZ Design Group, Inc. 984 Monument St, Suite 101, Pacific Palisades, CA 90272. LZDGI/LD/CA 5/10/23"
    },
    {
    "title": "Director of Innovation",
    "location": "Brea, CA",
    "description": "Develop new dental laboratory products, provide specifications for acquisition of equipment and materials for new products, prepare instructions for production of new dental lab products, supervise initial production of new products, researching new technologies related to dentistry, elaborate and manage biological testing of new products, prepare clinical evaluation reports for new products and assist in worldwide regulatory questions. Must have at least 36 months of experience as a Research and Development Manager for dental prosthetics, acrylic teeth, or related area. Special skills required: Proficiency in Pascal, CBC, CLICK, Macro Programming; and knowledge in Medical Devices Regulation (MDR). Send resumes and copy of job ad to HR Department, Harvest Dental Products LLC. 905 Columbia St, Brea, CA 92821. HDPLLC/DOI/CA 5/10/23"
    },
    {
    "title": "Mechanical Engineer",
    "location": "Snoqualmie, WA",
    "description": "Research, design, develop, test, prototype and run simulation of parts and components of patient monitoring products. Ensure products meet product performance, quality, and reliability specifications. Provide detailed design work, review technical drawings, and make simulation and component selection to meet product performance, quality, and reliability specifications. Confer with other engineers and designers to develop microprocessor-based instrumentation and component designs. Execute complex designs in the following disciplines: plastic injection molding, vacuum forming, machining, casting, stamping and sheet metal. Apply theoretical calculation to design in areas such as thermodynamics, fluid flow, or structural analysis by testing mathematical models to validate the capabilities and parameters of the design and to prove the prototype will do as design indicates. Prepare product requirements and provide technical reports and presentations. Telecommuting is available. Employer – Spacelabs Healthcare LLC. SHLLC/ME/CA 5/10/23"
    },
    {
    "title": "Market Researcher",
    "location": "Las Vegas, NV",
    "description": "Develop and execute and analyze results of comprehensive digital marketing strategies. Prepare comprehensive and detailed reports of finding to modify and fine-tune marketing campaigns for better performance and results. Develop and manage large-scale media buys across multiple digital platforms. Develop systems to collect and analyze data regarding targeted customer demographics, preferences, etc. that directly impact conversions. Collaborate with the Marketing Manager in all efforts to improve marketing strategies and research. Work on development of digital display ads and manage social medica channels to research and prepare reports of potential customers. Telecommuting is available. Employer – Silicon Valley High School, Inc. SVHSI/MR/CA 5/9/23"
    },
    {
    "title": "Operations Manager",
    "location": "Schaumburg, IL",
    "description": "Manage the day-to-day operations of the company to ensure smooth operations. Manage all human resources activities such as recruitment, hiring and firing, determining wages, administering disciplinary procedures and other personnel matters. Oversee training of all staff by subordinates. Review financial statements and sales reports to ensure goals are being achieved. Estimate anticipated expenditures and analyze records of present and past operations, trends and costs, estimated and realized revenues, administrative commitments and obligations incurred. Oversee the preparation of budgets and financial forecasts and present financial reports to the President for review. Communicate with customers to increase sales and manage the company’s brand. Ensure compliance with all applicable regulations. Telecommuting is available. Domestic Travel to Miami, FL 20% of the time. Employer – T&K Toka USA, Inc. TKTUSAI/OM/CA 5/9/23"
    },
    {
    "title": "Farm Manager",
    "location": "Delmar, DE",
    "description": "Manage all operations of farm. Supervise and train workers in planting, maintaining, cultivating, harvesting and other tasks. Maintain accurate records of crop production, yields, and end-user needs for future planting and management. Inspect and monitor crops and test soils. Ensure farm is properly stocked with all essential such as pesticides, fertilizer and other supplies and all staff adhere to health and safety regulations. Prepare and manage budgets to maximize profit. Determine planting and harvesting schedules. Employer – Food’s Style USA, Inc. FSUSAI/FM/CA 5/4/23"
    },
    {
    "title": "Design Manager",
    "location": "Woodland Hills, CA",
    "description": "Design Manager needed at Pico Events L.A., Inc. Full-time, must have Bachelor’s degree in Fine Arts or Advertising and 1 year experience as Lead Designer. Duties: Design and create visual and audio materials to meet specific commercial or promotional needs, such as for advertising, broadcast, and web communications. Confer with clients to ensure that all graphics, décor, marketing and promotional standards agreed to are maintained, ensuring that all projects are delivered within specified timelines and scope. Develop and/or produce a broad range of deliverables, including designs, concepts, layouts, graphics, and templates, based on knowledge of layout principles and aesthetic design concepts. Use computer software to generate graphic designs, layouts, and new images, including but not limited to Pixlr, Studio Max, DrawPad Graphic Editor, AutoCad, Adobe Photoshop, Illustrator, Premier, GIMP, Inkscape, etc. Study illustrations, photograph, and design briefs to determine requirements, conceptualize visuals, and plan presentation of materials, products, or services. Review final graphic design and layout if any improvement is necessary, and discuss them with the Project and Marketing Teams and clients. Research new software or design concepts and participate in team brainstorming sessions. Assist the Project and Marketing Teams with creative direction for global/local advertising campaigns, new product/store launches and other marketing initiatives to ensure accurate execution of material development and promotional materials. Send resume to Pico Events L.A., Inc., 20969 Ventura Blvd. #208, Woodland Hills, CA 91364. PELAI/DM/CA 4/28/23"
    },
    {
    "title": "Software Engineer",
    "location": "Irvine, CA",
    "description": "Design and develop ETL solutions by analyzing user needs. Use high level knowledge of data structures and big data framework, flow, patterns and governance to monitor existing data integrations to develop and design software solutions and optimize operational efficiency within limitations. Consult with Design, Data Science, and Backend Engineering teams in developing interfaces. Work on SQL query development and integration development for external vendor EHRs. Collaborate in the development, design and enforcement of the overall data integration and integration strategy. Sal $110,00-$130,000. Telecommuting is available. Employer – Hart, Inc.. HI/SE/CA 4/25/23"
    },
    {
    "title": "Systems Engineer",
    "location": "Los Angeles, CA",
    "description": "Responsible for design, installation and commissioning of solar photovoltaic diesel hybrid systems, grid-tied energy solar PV systems, off-grid and standalone solar PV systems; solar PV canopy design, structural analysis and installation; perform solar PV system monitoring including system performance, optimization and feed-in tariff management; conduct load shedding contingency planning and management as well as load shifting and peak shaving through demand management and automatic surplus generation activation. Conduct energy audits for energy optimization and implementation of remedy measures. GTR/SE/CA 4/24/23"
    },
    {
    "title": "Graphic Designer",
    "location": "Los Angeles, CA",
    "description": "The Korea Times Los Angeles, Inc. in Los Angeles, CA seeks graphic designer. Create graphic designs, concepts, and layouts. Produce graphics, ads, logos, direct mailers, etc. Use computer software to generate images. Research on design trends and design ideas. Send resume to HR at 3731 Wilshire Blvd. 10th Floor, Los Angeles, CA 90010. TKTLAI/GD/CA 4/24/23"
    },
    {
    "title": "Audit Manager",
    "location": "Los Angeles, CA",
    "description": "Audit Manager needed full-time by accounting firm to supervise and review audit papers. Manage team in reviewing financial statements. Review clients' operations. Prepare audit reports, etc.. BS in Accounting, 5 years accounting/audit experience, CA CPA license. Mail resume to job/interview site: Fineman West & Co.,801 S. Figueroa St., Suite 1000, Los Angeles, CA 90017. FWC/AM/CA 4/24/23"
    },
    {
    "title": "IT Project Manager",
    "location": "New York, NY",
    "description": "Meet with customers to assess client and end user needs to develop project. Organize project team, such as software engineers and user interface designers, to develop project roadmap, milestones, and schedule. Confer and work with team to resolve issues during project. Monitor and track project progress and deliverables from responsible parties. Makes decisions on the priority of implementations. Ensure project deliverables are of the agreed quality. Conduct quantitative analysis of the released products to ascertain problems and assess current and future client needs. Sal $141,000. Telecommuting is available. Employer – ISI-Dentsu of America, Inc. ISIDOAI/ITPM/CA 4/18/23"
    },
    {
    "title": "Solar Energy Systems Engineer",
    "location": "Napa, CA",
    "description": "Responsible for overseeing evaluation and regulation of energy efficiency within plans for solar energy systems, design, development, installation and monitoring of solar photovoltaic systems within the legal framework of EPC (Engineering Precurement and Construction) environment for diesel hybrid systems, grid-tied energy solar PV systems, off-grid and standalone solar PV systems. Perform solar PV system monitoring including system performance, optimization and feed-in tariff management. Perform site audits to gather and review data of systems. Oversee, review and interpret electrical single-line diagrams and connection diagrams for solar systems. Oversee the legal regulatory management of load shedding contingency planning and management as well as load shifting and peak shaving through demand management and automatic surplus generation activation. Conduct energy audits for energy optimization and implementation of remedy measures. Sal $77,100. Telecommuting is available. Employer – Bright Power, Inc. BPI/SESE/CA 4/17/23"
    },
    {
    "title": "IT Support Specialist",
    "location": "Los Angeles, CA",
    "description": "Install, and configure hardware, operating systems, and application software on new and existing PC, Mac, laptops, and printers. Manage Active Directory domain user and computer accounts. Manage inventory of software licenses and hardware assets. Respond to end user requests via phone, email, trouble tickets and walk ins; quickly identify, research, and resolve issues. Manage desk top protection utilities and provide an immediate response to outbreaks and new security updates. Create documentation for standard operating procedures, one off installations, and end-user training. Forty (40) hours per week, Full-time. Must have Bachelor's Degree in Management Information Systems, Business Administration in Computer Application or equivalent. Mail resume to Tax & Accounting Offices, Inc., 3701 Wilshire Boulevard, Suite 200, Los Angeles, CA 90010. Attention: M. Fahimdezhban. TAOI/ITSS/CA 4/17/23"
    },
    {
    "title": "Product Engineer",
    "location": "Los Angeles, CA",
    "description": "Scale Media Inc. is seeking a full-time Product Engineer in Los Angeles, CA. Job Duties: Analyze company engineering product requirement and develop product strategy into detailed software requirements for prototype construction and final product development. Research product specifications and identify engineering solutions for product feature gap closure. Create action plans for engineering team to build projects. Organize software requirements using Jira to ensure completeness of product specifications. Oversee and track feature release schedule maintenance and progress throughout product lifecycle. Develop solutions for new features in JavaScript, php, HTML and CSS. Query cloud database using mySQL. Deploy finalized code into workstream using Bitbucket and GitHub. Review code written by other engineers and propose fixes for bugs. Actively maintain cloud-based code repository and triage version conflicts. Develop documentation detailing business impact of key technical design decisions for C-Suite executives. Coordinate with cross functional team. Assess current and future customer needs and priorities by communicating directly with internal customers, conducting surveys, or other methods. The minimum education requirement is a Bachelor’s Degree in Mechanical Engineering or related field. Must have at least 24 months of experience in Mechanical/Product Engineer or similar. Special skills required: Proficiency in Jira, JavaScript, php, HTML, CSS, and mySQL. Send resumes and copy of job ad to HR Department, Scale Media Inc. 10215 Santa Monica Blvd, Los Angeles, CA 90067. No phone calls or visits please. SMI/PE/CA 4/10/23"
    },
    {
    "title": "Digital Marketing Assistant",
    "location": "Van Nuys, CA",
    "description": "Code email and landing page templates and create email blasts to advertise sales promotions. Design and develop content-related web pages for lead generation. Evaluates the design and functionality of supported websites and applications. Manage day-to-day maintenance, security, approvals, compliance, updates, and continuity for the websites and digital pages. Update databases, spreadsheets, and inventory lists. Support the marketing manager and marketing team with project organization. Perform administrative tasks to ensure the functionality of marketing activities. Compose and post online content for the company’s social media pages. Forty (40) hours/week, Full time. Must have Associate's Degree in Computer and Information Sciences, Information Technology, Marketing, Communications or related. Mail resume to Majool Inc., 6920 Hayvenhurst Avenue, Suite 208, Van Nuys, CA 91406. Attn: Marc Abazari. MI/DMA/CA 3/27/23"
    },
    {
    "title": "Administrative Supervisor",
    "location": "Garden Grove, CA",
    "description": "Administrative Supervisor needed full-time by healthcare facility to supervise staff, set budget, resolve complaints, set staff schedule, etc.. BS (any major) plus 2-year management/supervisory experience. Mail resume to job/interview site: Garden Grove Community Care Facility, 11661 Puryear Lane, Garden Grove, CA 92840. GGCCF/AS/CA 3/24/23"
    },
    {
    "title": "Project Engineer",
    "location": "Irvine, CA",
    "description": "Identify and recreate customer's issues in lab environment to recommend and clearly communicate resolutions. Work independently and with other members of the technical support team to resolve customer application issues in a timely fashion. Pre-sales resource to actively establish the technical relationship with customer’s engineers, management, and architects at focus accounts. Operate computer-assisted engineering or design software equipment to perform engineer task. Collaborate with Product Managers and Product Design Team in HQ to resolve technical issues and suggest product improvements. Create sample applications, product demos, technical documents and other related items for sales, marketing, and support efforts. Provide technical product training to sales team, channel partners, system integrators, OEMs, and end users. Maintain and improve current knowledge through personal education and training. Stay abreast of upcoming product releases as well as current and future technological trends. Confer with engineers, customers, or others to discuss existing or potential engineering projects. Assist in developing capital project programs for new equipment or major repairs. Investigate customer complaints to determine the nature and extent of the problem. Employer: Advantech Corporation, 380 Fairview Way, Milpitas, CA 95035. AC/PE/CA 3/14/23"
    },
    {
    "title": "Sr. Network Engineer",
    "location": "Irvine, CA",
    "description": "Recommend, develop and create network and wireless system designs for patient monitoring installations. Configure all network equipment including but not limited to firewalls, routers, network security, switches and wireless access points per design. Develop networks for remote patient monitoring that requires VPN tunnels over customer’s WAN backbone networks. Monitor and analyze network performance and reports to modify configurations. Troubleshoot network portion of server products as well as peripheral products and systems. Work with business partners using best practices for network design. Ensures that network design documentation is accurate and complete. Travel required 50% of the time to unanticipated locations in all 50 states. Employer – Nihon Kohden America, Inc. NKAI/SNE/CA 3/14/23"
    },
    {
    "title": "Assistant Property Manager",
    "location": "Los Angeles, CA",
    "description": "Assistant Property Manager needed full-time by property management company to plan repairs, remodels, schedule maintenance requests, inform tenants of repairs and progress, and negotiate with material providers, etc. Bachelors of Science (any major) graduate plus one (1) year construction-related experience. Mail resume to job/interview site: 409, LLC, 1248 S. Flower Street, Los Angeles, CA 90015. 409LLC/APM/CA 3/6/23"
    },
    {
    "title": "Associate Civil Engineer",
    "location": "Los Angeles, CA",
    "description": "Plan and direct the design and preparation of civil plans, drawings, specifications and estimates in connection with engineering projects. Supervise staff engineer and civil drafter on preparation of maps, plans, charts and diagrams; supervise maintenance of engineering records. Perform engineering office work on budget preparation, purchases, cost estimates, cost analysis, progress reports, and transform concept designs into working documents using AutoCAD, Civil 3D. Communicate effectively with clients, agencies and contractors. Conduct field work, site visits and perform other engineering duties as assigned. Forty (40) hours per week, full-time. Must have Bachelor's degree in Civil Engineering or equivalent and CA License as Professional Engineer - Registration as Professional Engineer with the State of California Board for Professional Engineers, Land Surveyors, and Geologists. Mail resume to Greystone Engineering Group, Inc., 11022 Santa Monica Blvd, Suite 440, Los Angeles, CA 90025. Attn: Soheil Mosseini. GEGI/ACE/CA 2/23/23"
    },
    {
    "title": "Concept Artist",
    "location": "El Segundo, CA",
    "description": "Pound Sand LLC dba Unbroken Studios is seeking a full time Concept Artist in El Segundo, CA. Job Duties: Build, sketch, ideate, and iterate 2D sketches and detailed renderings in collaboration with other developers for 3D artists and animators to implement into working game assets. Wo closely with the Art Director and art team to visualize and develop the final look of environment game elements. Work to champion process improvements, generate best practice standards, and evolve the craft of visual design across the company. Create inspiring environment concept art that the 3D artists can use to generate the final environments in the game. Perform research and analysis on given visual subjects to improve the potential art quality on the game. Generate mood boards and sketches that present options and solutions of how art assets should be represented in the game. Work with Art Director to creatively problem solve how to represent worlds and assets in the game. Develop and maintain a strong understanding of the product goals and design direction. Rapidly adapt creative styles as need while ensuring that all output adheres to and is complementary to the core game pillars and brand values. The minimum education requirement is a Bachelor degree in Design or related field. Must have at least 12 months of experience. Special skills required: Advanced proficiency in Adobe Photoshop and Wacom Tablet. Send resumes and copy of job ad to HR Department, Pound Sand LLC dba Unbroken Studios. 2120 Park Place, Suite 110, El Segundo, CA 90245. No phone calls or visits please. PSLLC/CA/CA 2/21/23"
    },
    {
    "title": "Social Media Coordinator",
    "location": "Los Angeles, CA",
    "description": "Very J Inc. in Los Angeles, California seeks social media coordinator. Create and publish contents. Make and manage company pages in social media platforms. Promote company’s products in social media. Develop and execute social media strategy. Annual salary of $91,666. Send resume to HR at 727 E. Pico Blvd. #4 Los Angeles, CA 90021. VJINC/SMC/CA 2/17/23"
    },
    {
    "title": "Technical Writer",
    "location": "Farmington Hills, MI",
    "description": "Collect, organize, and analyze data and documentation from stakeholders to prepare written documents regarding technical specifications for review by clients, management, designers, developers, and other technical staff. Plan and prepare technical reports, memoranda, and instruction manuals. Modify, amend, and maintain technical documentation utilized by software developers, engineers, and other technical staff in developing software. Maintain critical documentation, manuals, instructions, and other records used as reference. Integrate images, charts, and diagrams into materials to make them easier to understand and use. Ensure all technical written communications between software developers and engineers are clear and concise to ensure the sharing of technical information helps to test and develop products as efficiently as possible. Employer – Total Computing Solutions of America, Inc. TCSOAI/TW/CA 2/16/23"
    }
]